Enter one of the following commands in a valid format:

* read_comp {complex_var}, {real_part}, {imaginary_part}
	Reads values into a complex variable.
* print_comp {complex_var}
	Prints a complex variable.
* add_comp {complex_var}, {complex_var}
	Prints the result of adding two complex variables.
* sub_comp {complex_var}, {complex_var}
	Prints the result of subtracting two complex variables.
* mult_comp_real {complex_var}, {real}
	Prints the result of the mult of a complex with a real number.
* mult_comp_img {complex_var}, {imaginary}
	Prints the result of the mult of a complex with an imaginary number.
* mult_comp_comp {complex_var}, {complex_var}
	Prints the result of the mult of 2 complex numbers.
* abs_comp {complex_var}
	Prints the absolute value of a complex variable.
* stop
	Stops the program.

> mult_comp_real
Error: all parameters are missing

> Mult_comp_real
Error: undefined command name

> mult_comp_real ,
Error: illegal comma after the command name

> mult_comp_real F
Error: missing comma

> mult_comp_real 	E ,
Error: missing parameter

> mult_comp_real E, B
Error: invalid parameter - not a number

> mult_comp_real G, 3
Error: undefined complex variable

> mult_comp_real F, 3
0.00 + (0.00)i
Info: The function mult_comp_real has completed successfully

> mult_comp_real F, 3, 1
Error: extraneous text after end of command

> EOF was detected (which is illegal), stopping the program.
