Enter one of the following commands in a valid format:

* read_comp {complex_var}, {real_part}, {imaginary_part}
	Reads values into a complex variable.
* print_comp {complex_var}
	Prints a complex variable.
* add_comp {complex_var}, {complex_var}
	Prints the result of adding two complex variables.
* sub_comp {complex_var}, {complex_var}
	Prints the result of subtracting two complex variables.
* mult_comp_real {complex_var}, {real}
	Prints the result of the mult of a complex with a real number.
* mult_comp_img {complex_var}, {imaginary}
	Prints the result of the mult of a complex with an imaginary number.
* mult_comp_comp {complex_var}, {complex_var}
	Prints the result of the mult of 2 complex numbers.
* abs_comp {complex_var}
	Prints the absolute value of a complex variable.
* stop
	Stops the program.

> read_comp ,
Error: illegal comma after the command name

> read_comp A
Error: missing comma

> read_comp T
Error: undefined complex variable

> read_comp A,
Error: missing parameter

> read_comp A ,   ,
Error: multiple consecutive commas

> read_comp A, ,,
Error: multiple consecutive commas

> read_compA
Error: undefined command name

> read_comp T,
Error: undefined complex variable

> read_comp A, 1
Error: missing comma

> read_comp A, 1s
Error: invalid parameter for real part - not a number

> read_comp A, 1, 2da
Error: invalid parameter for imaginary part - not a number

> read_comp A, 1
Error: missing comma

> read_comp A, 1,
Error: invalid parameter for imaginary part - not a number

> read_comp A, 1,   ,
Error: multiple consecutive commas

> read_comp A,    , 1, 2
Error: multiple consecutive commas

> read_comp A, 1.4, -2.7
Info: The function read_comp has completed successfully

> read_comp A, 1, 2   ,
Error: illegal comma

> read_comp A, -1.2, 2.c
Error: invalid parameter for imaginary part - not a number

> read_comp A, 1, 2 asd
Error: extraneous text after end of command

> EOF was detected (which is illegal), stopping the program.
