> read_comp G, 3.1, 6.5
Error: undefined complex variable

> read_comp a, 3.6, 5.1
Error: undefined complex variable

> do_it A, B
Error: undefined command name

> Add_Comp A, C
Error: undefined command name

> read_comp A, 3.5, xyz
Error: invalid parameter for imaginary part - not a number

> read_comp A, 3.5
Error: missing comma

> read_comp A, 3.5, -3,
Error: invalid parameter for imaginary part - not a number

> add_comp B
Error: missing comma

> print_comp C, D
Error: extraneous text after end of command

> sub_comp F, , D
Error: multiple consecutive commas

> mult_comp_comp F D
Error: missing comma

> mult_comp_real, A, 2.5
Error: illegal comma after the command name

> mult_comp_img A, B
Error: invalid parameter - not a number

> abs_comp
Error: all parameters are missing

> abs_comp 2.5
Error: undefined complex variable

> stop A
Error: extraneous text after end of command

> 