Enter one of the following commands in a valid format:

* read_comp {complex_var}, {real_part}, {imaginary_part}
	Reads values into a complex variable.
* print_comp {complex_var}
	Prints a complex variable.
* add_comp {complex_var}, {complex_var}
	Prints the result of adding two complex variables.
* sub_comp {complex_var}, {complex_var}
	Prints the result of subtracting two complex variables.
* mult_comp_real {complex_var}, {real}
	Prints the result of the mult of a complex with a real number.
* mult_comp_img {complex_var}, {imaginary}
	Prints the result of the mult of a complex with an imaginary number.
* mult_comp_comp {complex_var}, {complex_var}
	Prints the result of the mult of 2 complex numbers.
* abs_comp {complex_var}
	Prints the absolute value of a complex variable.
* stop
	Stops the program.

> read_comp G, 3.1, 6.5
Error: undefined complex variable

> read_comp a, 3.6, 5.1
Error: undefined complex variable

> do_it A, B
Error: undefined command name

> Add_Comp A, C
Error: undefined command name

> read_comp A, 3.5, xyz
Error: invalid parameter for imaginary part - not a number

> read_comp A, 3.5
Error: missing comma

> read_comp A, 3.5, -3,
Error: illegal comma

> add_comp B
Error: missing comma

> print_comp C, D
Error: extraneous text after end of command

> sub_comp F, , D
Error: multiple consecutive commas

> mult_comp_comp F D
Error: missing comma

> mult_comp_real, A, 2.5
Error: illegal comma after the command name

> mult_comp_img A, B
Error: invalid parameter - not a number

> abs_comp
Error: all parameters are missing

> abs_comp 2.5
Error: undefined complex variable

> stop A
Error: extraneous text after end of command

> EOF was detected (which is illegal), stopping the program.
