Enter one of the following commands in a valid format:

* read_comp {complex_var}, {real_part}, {imaginary_part}
	Reads values into a complex variable.
* print_comp {complex_var}
	Prints a complex variable.
* add_comp {complex_var}, {complex_var}
	Prints the result of adding two complex variables.
* sub_comp {complex_var}, {complex_var}
	Prints the result of subtracting two complex variables.
* mult_comp_real {complex_var}, {real}
	Prints the result of the mult of a complex with a real number.
* mult_comp_img {complex_var}, {imaginary}
	Prints the result of the mult of a complex with an imaginary number.
* mult_comp_comp {complex_var}, {complex_var}
	Prints the result of the mult of 2 complex numbers.
* abs_comp {complex_var}
	Prints the absolute value of a complex variable.
* stop
	Stops the program.

> mult_comp_comp
Error: all parameters are missing

> mult_comp_comp    , A
Error: illegal comma after the command name

> multcompcomp
Error: undefined command name

> MULT_COMP_COMP
Error: undefined command name

> mult_comp_comp A,	 G
Error: undefined complex variable

> mult_comp_comp   A
Error: missing comma

> mult_comp_comp C, E
0.00 + (0.00)i
Info: The function mult_comp_comp has completed successfully

> mult_comp_comp    E, 	, F
Error: multiple consecutive commas

> mult_comp_comp A, FF
Error: extraneous text after end of command

> mult_comp_comp -0.1
Error: undefined complex variable

> EOF was detected (which is illegal), stopping the program.
